{
    "status": "OK",
    "data": [
        {
            "id": "186287285",
            "authors": [
                "Martorano III, Robert Frank"
            ],
            "contributors": [],
            "datePublished": "2018-11-06T00:00:00",
            "description": "The abundance of text data being produced in the modern age makes it\nincreasingly important to intuitively group, categorize, or classify text data\nby theme for efficient retrieval and search. Yet, the high dimensionality and\nimprecision of text data, or more generally language as a whole, prove to be\nchallenging when attempting to perform unsupervised document clustering. In\nthis thesis, we present two novel methods for improving unsupervised document\nclustering/classification by theme. The first is to improve document\nrepresentations. We look to exploit \"term neighborhoods\" and \"blur\" semantic\nweight across neighboring terms. These neighborhoods are located in the\nsemantic space afforded by \"word embeddings.\" The second method is for cluster\nrevision, based on what we deem as \"stochastic barcoding\", or \"S- Barcode\"\npatterns. Text data is inherently high dimensional, yet clustering typically\ntakes place in a low dimensional representation space. Our method utilizes\nlower dimension clustering results as initial cluster configurations, and\niteratively revises the configuration in the high dimensional space. We show\nwith experimental results how both of the two methods improve the quality of\ndocument clustering. While this thesis elaborates on the two new conceptual\ncontributions, a joint thesis by David Yan details the feature transformation\nand software architecture we developed for unsupervised document\nclassification",
            "identifiers": [
                "oai:arXiv.org:1811.02456",
                null
            ],
            "language": {
                "code": "en",
                "id": 9,
                "name": "English"
            },
            "relations": [],
            "repositories": [
                {
                    "id": "144",
                    "openDoarId": 0,
                    "name": "arXiv.org e-Print Archive",
                    "urlHomepage": null,
                    "urlOaipmh": null,
                    "uriJournals": null,
                    "physicalName": "noname",
                    "source": null,
                    "software": null,
                    "metadataFormat": null,
                    "description": null,
                    "journal": null,
                    "roarId": 0,
                    "baseId": 0,
                    "pdfStatus": null,
                    "nrUpdates": 0,
                    "disabled": false,
                    "lastUpdateTime": null,
                    "repositoryLocation": null
                }
            ],
            "repositoryDocument": {
                "pdfStatus": 1,
                "metadataAdded": 1549435615000,
                "metadataUpdated": 1608820892000,
                "depositedDate": 1541548800000
            },
            "subjects": [
                "text"
            ],
            "title": "Semantic Term \"Blurring\" and Stochastic \"Barcoding\" for Improved\n  Unsupervised Text Classification",
            "topics": [
                "Computer Science - Computation and Language",
                "Computer Science - Machine Learning"
            ],
            "types": [],
            "year": 2018,
            "fulltextIdentifier": "http://arxiv.org/abs/1811.02456",
            "oai": "oai:arXiv.org:1811.02456",
            "downloadUrl": "http://arxiv.org/abs/1811.02456"
        },
        {
            "id": "199241181",
            "authors": [
                "Alghamdi, H. M.",
                "Selamat, A."
            ],
            "contributors": [],
            "datePublished": "2017-01-01T00:00:00",
            "description": "Clustering is the method employed to group Web pages containing related information into clusters, which facilitates the allocation of relevant information. Clustering performance is mostly dependent on the text features' characteristics. The Arabic language has a complex morphology and is highly inflected. Thus, selecting appropriate features affects clustering performance positively. Many studies have addressed the clustering problem in Web pages with Arabic content. There are three main challenges in applying text clustering to Arabic Web page content. The first challenge concerns difficulty with identifying significant term features to represent original content by considering the hidden knowledge. The second challenge is related to reducing data dimensionality without losing essential information. The third challenge regards how to design a suitable model for clustering Arabic text that is capable of improving clustering performance. This paper presents an overview of existing Arabic Web page clustering methods, with the goals of clarifying existing problems and examining feature selection and reduction techniques for solving clustering difficulties. In line with the objectives and scope of this study, the present research is a joint effort to improve feature selection and vectorization frameworks in order to enhance current text analysis techniques that can be applied to Arabic Web pages",
            "identifiers": [
                "oai:generic.eprints.org:77231/core392",
                "10.1016/j.jksuci.2017.06.002"
            ],
            "publisher": "'Elsevier BV'",
            "relations": [
                "http://eprints.utm.my/id/eprint/77231/",
                "https://www.scopus.com/inward/record.uri?eid=2-s2.0-85021224854&doi=10.1016%2fj.jksuci.2017.06.002&partnerID=40&md5=8ef41df32ef52c5a8531f4017d77b52d"
            ],
            "repositories": [
                {
                    "id": "392",
                    "openDoarId": 0,
                    "name": "Universiti Teknologi Malaysia Institutional Repository",
                    "urlHomepage": null,
                    "urlOaipmh": null,
                    "uriJournals": null,
                    "physicalName": "noname",
                    "source": null,
                    "software": null,
                    "metadataFormat": null,
                    "description": null,
                    "journal": null,
                    "roarId": 0,
                    "baseId": 0,
                    "pdfStatus": null,
                    "nrUpdates": 0,
                    "disabled": false,
                    "lastUpdateTime": null,
                    "repositoryLocation": null
                }
            ],
            "repositoryDocument": {
                "pdfStatus": 1,
                "metadataAdded": 1557867217000,
                "metadataUpdated": 1608333516000,
                "depositedDate": 1527756806000
            },
            "subjects": [
                "Article",
                "PeerReviewed"
            ],
            "title": "Arabic web page clustering: a review",
            "topics": [
                "QA75 Electronic computers. Computer science"
            ],
            "types": [],
            "year": 2017,
            "fulltextIdentifier": "https://core.ac.uk/download/199241181.pdf",
            "doi": "10.1016/j.jksuci.2017.06.002",
            "oai": "oai:generic.eprints.org:77231/core392",
            "downloadUrl": "https://core.ac.uk/download/199241181.pdf"
        },
        {
            "id": "162543708",
            "authors": [
                "Luo, Xiao",
                "Shah, Setu"
            ],
            "contributors": [
                "Computer Information and Graphics Technology, School of Engineering and Technology"
            ],
            "datePublished": "2018-11-01T00:00:00",
            "description": "Biomedical text clustering is a text mining technique used to provide better document search, browsing, and retrieval in biomedical and clinical text collections. In this research, the document representation based on the concept embedding along with the proposed weighting scheme is explored. The concept embedding is learned through the neural networks to capture the associations between the concepts. The proposed weighting scheme makes use of the concept associations to build document vectors for clustering. We evaluate two types of concept embedding and new weighting scheme for text clustering and visualization on two different biomedical text collections. The returned results demonstrate that the concept embedding along with the new weighting scheme performs better than the baseline tf–idf for clustering and visualization. Based on the internal clustering evaluation metric-Davies–Bouldin index and the visualization, the concept embedding generated from aggregated word embedding can form well-separated clusters, whereas the intact concept embedding can better identify more clusters of specific diseases and gain better F-measure",
            "identifiers": [
                "oai:scholarworks.iupui.edu:1805/18062",
                "10.1186/s40535-018-0055-8"
            ],
            "journals": [
                {
                    "title": "Applied Informatics",
                    "identifiers": [
                        "2196-0089",
                        "issn:2196-0089"
                    ]
                }
            ],
            "publisher": "'Springer Science and Business Media LLC'",
            "relations": [],
            "repositories": [
                {
                    "id": "1651",
                    "openDoarId": 0,
                    "name": "IUPUIScholarWorks",
                    "urlHomepage": null,
                    "urlOaipmh": null,
                    "uriJournals": null,
                    "physicalName": "noname",
                    "source": null,
                    "software": null,
                    "metadataFormat": null,
                    "description": null,
                    "journal": null,
                    "roarId": 0,
                    "baseId": 0,
                    "pdfStatus": null,
                    "nrUpdates": 0,
                    "disabled": false,
                    "lastUpdateTime": null,
                    "repositoryLocation": null
                }
            ],
            "repositoryDocument": {
                "pdfStatus": 1,
                "metadataAdded": 1546898245000,
                "metadataUpdated": 1611509029000,
                "depositedDate": 1546499047000
            },
            "subjects": [
                "Article"
            ],
            "title": "Concept embedding-based weighting scheme for biomedical text clustering and visualization",
            "topics": [
                "Biomedical text clustering",
                "Visualization",
                "Concept embedding",
                "Neural networks"
            ],
            "types": [],
            "year": 2018,
            "fulltextIdentifier": "https://core.ac.uk/download/162543708.pdf",
            "doi": "10.1186/s40535-018-0055-8",
            "oai": "oai:scholarworks.iupui.edu:1805/18062",
            "downloadUrl": "https://core.ac.uk/download/162543708.pdf"
        },
        {
            "id": "229655940",
            "authors": [
                "Zandieh, Parisa",
                "Shakibapoor, Elham"
            ],
            "contributors": [],
            "datePublished": "2017-08-27T00:00:00",
            "description": "Clustering is one of the most important data mining techniques which categorize a large number of unordered text documents into meaningful and coherent clusters. Most of text clustering algorithms do not consider the semantic relationships between words and do not have the ability to recognize and use the semantic concepts.In this paper, a new algorithm has been presented to cluster texts based on meanings of the words. First, a new method has been presented to find semantic relationship between words based on Wordnet ontology then, text data is clustered using the proposed method and hierarchical clustering algorithm. Documents are preprocessed, converted to vector space model, and then are clustered using the proposed algorithm semantically. The experimental results show that the quality and accuracy of the proposed algorithm are more reliable than the existing hierarchical clustering algorithms",
            "identifiers": [
                "oai:ojs.ijcjournal.org:article/1032",
                null
            ],
            "publisher": "International Scientific Research and Researchers Association (ISRRA)",
            "relations": [
                "https://ijcjournal.org/index.php/InternationalJournalOfComputer/article/view/1032/458"
            ],
            "repositories": [
                {
                    "id": "13268",
                    "openDoarId": 0,
                    "name": "International Journal of Computer (IJC - Global Society of Scientific Research and Researchers, GSSRR)",
                    "urlHomepage": null,
                    "urlOaipmh": null,
                    "uriJournals": null,
                    "physicalName": "noname",
                    "source": null,
                    "software": null,
                    "metadataFormat": null,
                    "description": null,
                    "journal": null,
                    "roarId": 0,
                    "baseId": 0,
                    "pdfStatus": null,
                    "nrUpdates": 0,
                    "disabled": false,
                    "lastUpdateTime": null,
                    "repositoryLocation": null
                }
            ],
            "repositoryDocument": {
                "pdfStatus": 1,
                "metadataAdded": 1571341802000,
                "metadataUpdated": 1613886220000,
                "depositedDate": 1504117104000
            },
            "subjects": [
                "info:eu-repo/semantics/article",
                "info:eu-repo/semantics/publishedVersion",
                "Peer-reviewed Article"
            ],
            "title": "Clustering Data Text Based on Semantic",
            "topics": [
                "Text mining",
                "Text clustering",
                "Hierarchical clustering",
                "Ontology",
                "Semantic relationship."
            ],
            "types": [],
            "year": 2017,
            "fulltextIdentifier": "https://core.ac.uk/download/229655940.pdf",
            "oai": "oai:ojs.ijcjournal.org:article/1032",
            "downloadUrl": "https://core.ac.uk/download/229655940.pdf"
        },
        {
            "id": "189720909",
            "authors": [
                "Kingston, Charlie",
                "Nurse, Jason R. C.",
                "Agrafiotis, Ioannis",
                "Milich, Andrew"
            ],
            "contributors": [],
            "datePublished": "2018-07-30T00:00:00",
            "description": "In recent years, situation awareness has been recognised as a critical part of effective decision making, in particular for crisis management. One way to extract value and allow for better situation awareness is to develop a system capable of analysing a dataset of multiple posts, and clustering consistent posts into different views or stories (or, world views). However, this can be challenging as it requires an understanding of the data, including determining what is consistent data, and what data corroborates other data. Attempting to address these problems, this article proposes Subject-Verb-Object Semantic Suffix Tree Clustering (SVOSSTC) and a system to support it, with a special focus on Twitter content. The novelty and value of SVOSSTC is its emphasis on utilising the Subject-Verb-Object (SVO) typology in order to construct semantically consistent world views, in which individuals---particularly those involved in crisis response---might achieve an enhanced picture of a situation from social media data. To evaluate our system and its ability to provide enhanced situation awareness, we tested it against existing approaches, including human data analysis, using a variety of real-world scenarios. The results indicated a noteworthy degree of evidence (e.g., in cluster granularity and meaningfulness) to affirm the suitability and rigour of our approach. Moreover, these results highlight this article's proposals as innovative and practical system contributions to the research field",
            "identifiers": [
                "oai:kar.kent.ac.uk:67656",
                "10.1186/s13673-018-0145-6"
            ],
            "publisher": "'Springer Science and Business Media LLC'",
            "relations": [],
            "repositories": [
                {
                    "id": "57",
                    "openDoarId": 0,
                    "name": "Kent Academic Repository",
                    "urlHomepage": null,
                    "urlOaipmh": null,
                    "uriJournals": null,
                    "physicalName": "noname",
                    "source": null,
                    "software": null,
                    "metadataFormat": null,
                    "description": null,
                    "journal": null,
                    "roarId": 0,
                    "baseId": 0,
                    "pdfStatus": null,
                    "nrUpdates": 0,
                    "disabled": false,
                    "lastUpdateTime": null,
                    "repositoryLocation": null
                }
            ],
            "repositoryDocument": {
                "pdfStatus": 1,
                "metadataAdded": 1553607990000,
                "metadataUpdated": 1613807033000,
                "depositedDate": 1547200636000
            },
            "subjects": [
                "H1",
                "QA",
                "T"
            ],
            "title": "Using semantic clustering to support situation awareness on Twitter: The case of World Views",
            "topics": [
                "H1",
                "QA",
                "T"
            ],
            "types": [],
            "year": 2018,
            "fulltextIdentifier": "https://core.ac.uk/download/189720909.pdf",
            "doi": "10.1186/s13673-018-0145-6",
            "oai": "oai:kar.kent.ac.uk:67656",
            "downloadUrl": "https://core.ac.uk/download/189720909.pdf"
        },
        {
            "id": "186273962",
            "authors": [
                "Zhu, Qijun",
                "Li, Dandan",
                "Lee, Dik Lun"
            ],
            "contributors": [],
            "datePublished": "2018-10-05T00:00:00",
            "description": "As the web expands in data volume and in geographical distribution,\ncentralized search methods become inefficient, leading to increasing interest\nin cooperative information retrieval, e.g., federated text retrieval (FTR).\nDifferent from existing centralized information retrieval (IR) methods, in\nwhich search is done on a logically centralized document collection, FTR is\ncomposed of a number of peers, each of which is a complete search engine by\nitself. To process a query, FTR requires firstly the identification of\npromising peers that host the relevant documents and secondly the retrieval of\nthe most relevant documents from the selected peers. Most of the existing\nmethods only apply traditional IR techniques that treat each text collection as\na single large document and utilize term matching to rank the collections. In\nthis paper, we formalize the problem and identify the properties of FTR, and\nanalyze the feasibility of extending LSI with clustering to adapt to FTR, based\non which a novel approach called Cluster-based Distributed Latent Semantic\nIndexing (C-DLSI) is proposed. C-DLSI distinguishes the topics of a peer with\nclustering, captures the local LSI spaces within the clusters, and consider the\nrelations among these LSI spaces, thus providing more precise characterization\nof the peer. Accordingly, novel descriptors of the peers and a compatible local\ntext retrieval are proposed. The experimental results show that C-DLSI\noutperforms existing methods",
            "identifiers": [
                "oai:arXiv.org:1810.02579",
                null
            ],
            "language": {
                "code": "en",
                "id": 9,
                "name": "English"
            },
            "relations": [],
            "repositories": [
                {
                    "id": "144",
                    "openDoarId": 0,
                    "name": "arXiv.org e-Print Archive",
                    "urlHomepage": null,
                    "urlOaipmh": null,
                    "uriJournals": null,
                    "physicalName": "noname",
                    "source": null,
                    "software": null,
                    "metadataFormat": null,
                    "description": null,
                    "journal": null,
                    "roarId": 0,
                    "baseId": 0,
                    "pdfStatus": null,
                    "nrUpdates": 0,
                    "disabled": false,
                    "lastUpdateTime": null,
                    "repositoryLocation": null
                }
            ],
            "repositoryDocument": {
                "pdfStatus": 1,
                "metadataAdded": 1549435441000,
                "metadataUpdated": 1608820782000,
                "depositedDate": 1538953200000
            },
            "subjects": [
                "text"
            ],
            "title": "C-DLSI: An Extended LSI Tailored for Federated Text Retrieval",
            "topics": [
                "Computer Science - Information Retrieval"
            ],
            "types": [],
            "year": 2018,
            "fulltextIdentifier": "http://arxiv.org/abs/1810.02579",
            "oai": "oai:arXiv.org:1810.02579",
            "downloadUrl": "http://arxiv.org/abs/1810.02579"
        },
        {
            "id": "160773361",
            "authors": [
                "Kingston, Charlie",
                "Nurse, Jason R. C.",
                "Agrafiotis, Ioannis",
                "Milich, Andrew"
            ],
            "contributors": [],
            "datePublished": "2018-07-17T00:00:00",
            "description": "In recent years, situation awareness has been recognised as a critical part\nof effective decision making, in particular for crisis management. One way to\nextract value and allow for better situation awareness is to develop a system\ncapable of analysing a dataset of multiple posts, and clustering consistent\nposts into different views or stories (or, world views). However, this can be\nchallenging as it requires an understanding of the data, including determining\nwhat is consistent data, and what data corroborates other data. Attempting to\naddress these problems, this article proposes Subject-Verb-Object Semantic\nSuffix Tree Clustering (SVOSSTC) and a system to support it, with a special\nfocus on Twitter content. The novelty and value of SVOSSTC is its emphasis on\nutilising the Subject-Verb-Object (SVO) typology in order to construct\nsemantically consistent world views, in which individuals---particularly those\ninvolved in crisis response---might achieve an enhanced picture of a situation\nfrom social media data. To evaluate our system and its ability to provide\nenhanced situation awareness, we tested it against existing approaches,\nincluding human data analysis, using a variety of real-world scenarios. The\nresults indicated a noteworthy degree of evidence (e.g., in cluster granularity\nand meaningfulness) to affirm the suitability and rigour of our approach.\nMoreover, these results highlight this article's proposals as innovative and\npractical system contributions to the research field",
            "identifiers": [
                "oai:arXiv.org:1807.06588",
                null
            ],
            "language": {
                "code": "en",
                "id": 9,
                "name": "English"
            },
            "relations": [],
            "repositories": [
                {
                    "id": "144",
                    "openDoarId": 0,
                    "name": "arXiv.org e-Print Archive",
                    "urlHomepage": null,
                    "urlOaipmh": null,
                    "uriJournals": null,
                    "physicalName": "noname",
                    "source": null,
                    "software": null,
                    "metadataFormat": null,
                    "description": null,
                    "journal": null,
                    "roarId": 0,
                    "baseId": 0,
                    "pdfStatus": null,
                    "nrUpdates": 0,
                    "disabled": false,
                    "lastUpdateTime": null,
                    "repositoryLocation": null
                }
            ],
            "repositoryDocument": {
                "pdfStatus": 1,
                "metadataAdded": 1536390583000,
                "metadataUpdated": 1608820508000,
                "depositedDate": 1531868400000
            },
            "subjects": [
                "text"
            ],
            "title": "Using semantic clustering to support situation awareness on Twitter: The\n  case of World Views",
            "topics": [
                "Computer Science - Computation and Language"
            ],
            "types": [],
            "year": 2018,
            "fulltextIdentifier": "http://arxiv.org/abs/1807.06588",
            "oai": "oai:arXiv.org:1807.06588",
            "downloadUrl": "http://arxiv.org/abs/1807.06588"
        },
        {
            "id": "196581376",
            "authors": [
                "Alnajran, Noufa Abdulaziz"
            ],
            "contributors": [],
            "datePublished": "2019-03-01T00:00:00",
            "description": "Twitter, the most popular microblogging platform, is gaining rapid prominence as a source of\n\ninformation sharing and social awareness due to its popularity and massive user generated\n\ncontent. These include applications such as tailoring advertisement campaigns, event\n\ndetection, trends analysis, and prediction of micro-populations. The aforementioned\n\napplications are generally conducted through cluster analysis of tweets to generate a more\n\nconcise and organized representation of the massive raw tweets. However, current approaches\n\nperform traditional cluster analysis using conventional proximity measures, such as Euclidean\n\ndistance. However, the sheer volume, noise, and dynamism of Twitter, impose challenges that\n\nhinder the efficacy of traditional clustering algorithms in detecting meaningful clusters within\n\nmicroblogging posts. The research presented in this thesis sets out to design and develop a\n\nnovel short text semantic similarity (STSS) measure, named TREASURE, which captures the\n\nsemantic and structural features of microblogging posts for intelligently predicting the\n\nsimilarities. TREASURE is utilised in the development of an innovative semantic-based\n\ncluster analysis algorithm (SBCA) that contributes in generating more accurate and\n\nmeaningful granularities within microblogging posts. The integrated semantic-based\n\nframework incorporating TREASURE and the SBCA algorithm tackles both the problem of\n\nmicroblogging cluster analysis and contributes to the success of a variety of natural language\n\nprocessing (NLP) and computational intelligence research.\n\nTREASURE utilises word embedding neural network (NN) models to capture the semantic\n\nrelationships between words based on their co-occurrences in a corpus. Moreover,\n\nTREASURE analyses the morphological and lexical structure of tweets to predict the syntactic\n\nsimilarities. An intrinsic evaluation of TREASURE was performed with reference to a reliable\n\nsimilarity benchmark generated through an experiment to gather human ratings on a Twitter\n\npolitical dataset. A further evaluation was performed with reference to the SemEval-2014\n\nsimilarity benchmark in order to validate the generalizability of TREASURE. The intrinsic\n\nevaluation and statistical analysis demonstrated a strong positive linear correlation between\n\nTREASURE and human ratings for both benchmarks. Furthermore, TREASURE achieved a\n\nsignificantly higher correlation coefficient compared to existing state-of-the-art STSS\n\nmeasures.\n\nThe SBCA algorithm incorporates TREASURE as the proximity measure. Unlike\n\nconventional partition-based clustering algorithms, the SBCA algorithm is fully unsupervised\n\nand dynamically determine the number of clusters beforehand. Subjective evaluation criteria\n\nwere employed to evaluate the SBCA algorithm with reference to the SemEval-2014 similarity\n\nbenchmark. Furthermore, an experiment was conducted to produce a reliable multi-class\n\nbenchmark on the European Referendum political domain, which was also utilised to evaluate\n\nthe SBCA algorithm. The evaluation results provide evidence that the SBCA algorithm\n\nundertakes highly accurate combining and separation decisions and can generate pure clusters\n\nfrom microblogging posts.\n\nThe contributions of this thesis to knowledge are mainly demonstrated as: 1) Development\n\nof a novel STSS measure for microblogging posts (TREASURE). 2) Development of a new\n\nSBCA algorithm that incorporates TREASURE to detect semantic themes in microblogs. 3)\n\nGenerating a word embedding pre-trained model learned from a large corpus of political\n\ntweets. 4) Production of a reliable similarity-annotated benchmark and a reliable multi-class\n\nbenchmark in the domain of politics",
            "identifiers": [
                "oai:e-space.mmu.ac.uk:622770",
                null
            ],
            "relations": [
                "http://e-space.mmu.ac.uk/622770/"
            ],
            "repositories": [
                {
                    "id": "35",
                    "openDoarId": 0,
                    "name": "E-space: Manchester Metropolitan University's Research Repository",
                    "urlHomepage": null,
                    "urlOaipmh": null,
                    "uriJournals": null,
                    "physicalName": "noname",
                    "source": null,
                    "software": null,
                    "metadataFormat": null,
                    "description": null,
                    "journal": null,
                    "roarId": 0,
                    "baseId": 0,
                    "pdfStatus": null,
                    "nrUpdates": 0,
                    "disabled": false,
                    "lastUpdateTime": null,
                    "repositoryLocation": null
                }
            ],
            "repositoryDocument": {
                "pdfStatus": 1,
                "metadataAdded": 1557147286000,
                "metadataUpdated": 1612964853000,
                "depositedDate": 1555212132000
            },
            "subjects": [
                "Thesis",
                "NonPeerReviewed"
            ],
            "title": "An integrated semantic-based framework for intelligent similarity measurement and clustering of microblogging posts",
            "topics": [],
            "types": [],
            "year": 2019,
            "fulltextIdentifier": "https://core.ac.uk/download/196581376.pdf",
            "oai": "oai:e-space.mmu.ac.uk:622770",
            "downloadUrl": "https://core.ac.uk/download/196581376.pdf"
        },
        {
            "id": "186299899",
            "authors": [
                "Ortiz, Michael Segundo",
                "Seki, Kazuhiro",
                "Mostafa, Javed"
            ],
            "contributors": [],
            "datePublished": "2018-12-05T00:00:00",
            "description": "The current mode of biomedical literature search is severely limited in\neffectively finding information relevant to specialists. A potential approach\nto solving this problem is exploratory search, which allows users to\ninteractively navigate through a vast document collection. As the first step\ntoward exploratory search for specialists in biomedicine, this paper develops a\nmethodology to evaluate quality of document clusters. For this purpose, we\nincorporate human expertise into data set creation and evaluation framework by\nleveraging MeSH terms as semantic anchors. In addition, we investigate the\nbenefit of full-text data for improving cluster quality.Comment: This work is currently under consideration for the 17th World\n  Congress of Medical and Health Informatics. Please follow the link for more\n  information - http://www.medinfo-lyon.org/en/about-us/medinfo2019",
            "identifiers": [
                "oai:arXiv.org:1812.02129",
                null
            ],
            "language": {
                "code": "en",
                "id": 9,
                "name": "English"
            },
            "relations": [],
            "repositories": [
                {
                    "id": "144",
                    "openDoarId": 0,
                    "name": "arXiv.org e-Print Archive",
                    "urlHomepage": null,
                    "urlOaipmh": null,
                    "uriJournals": null,
                    "physicalName": "noname",
                    "source": null,
                    "software": null,
                    "metadataFormat": null,
                    "description": null,
                    "journal": null,
                    "roarId": 0,
                    "baseId": 0,
                    "pdfStatus": null,
                    "nrUpdates": 0,
                    "disabled": false,
                    "lastUpdateTime": null,
                    "repositoryLocation": null
                }
            ],
            "repositoryDocument": {
                "pdfStatus": 1,
                "metadataAdded": 1549435778000,
                "metadataUpdated": 1608820998000,
                "depositedDate": 1544054400000
            },
            "subjects": [
                "text"
            ],
            "title": "Toward Exploratory Search in Biomedicine: Evaluating Document Clusters\n  by MeSH as a Semantic Anchor",
            "topics": [
                "Computer Science - Information Retrieval",
                "Computer Science - Digital Libraries",
                "Computer Science - Human-Computer Interaction"
            ],
            "types": [],
            "year": 2018,
            "fulltextIdentifier": "http://arxiv.org/abs/1812.02129",
            "oai": "oai:arXiv.org:1812.02129",
            "downloadUrl": "http://arxiv.org/abs/1812.02129"
        },
        {
            "id": "186280980",
            "authors": [
                "Shah, Setu",
                "Luo, Xiao"
            ],
            "contributors": [],
            "datePublished": "2018-10-22T00:00:00",
            "description": "Document clustering is a text mining technique used to provide better\ndocument search and browsing in digital libraries or online corpora. A lot of\nresearch has been done on biomedical document clustering that is based on using\nexisting ontology. But, associations and co-occurrences of the medical concepts\nare not well represented by using ontology. In this research, a vector\nrepresentation of concepts of diseases and similarity measurement between\nconcepts are proposed. They identify the closest concepts of diseases in the\ncontext of a corpus. Each document is represented by using the vector space\nmodel. A weight scheme is proposed to consider both local content and\nassociations between concepts. A Self-Organizing Map is used as document\nclustering algorithm. The vector projection and visualization features of SOM\nenable visualization and analysis of the clusters distributions and\nrelationships on the two dimensional space. The experimental results show that\nthe proposed document clustering framework generates meaningful clusters and\nfacilitate visualization of the clusters based on the concepts of diseases.Comment: KDD 2017's Data Driven Discovery Worksho",
            "identifiers": [
                "oai:arXiv.org:1810.09597",
                null
            ],
            "language": {
                "code": "en",
                "id": 9,
                "name": "English"
            },
            "relations": [],
            "repositories": [
                {
                    "id": "144",
                    "openDoarId": 0,
                    "name": "arXiv.org e-Print Archive",
                    "urlHomepage": null,
                    "urlOaipmh": null,
                    "uriJournals": null,
                    "physicalName": "noname",
                    "source": null,
                    "software": null,
                    "metadataFormat": null,
                    "description": null,
                    "journal": null,
                    "roarId": 0,
                    "baseId": 0,
                    "pdfStatus": null,
                    "nrUpdates": 0,
                    "disabled": false,
                    "lastUpdateTime": null,
                    "repositoryLocation": null
                }
            ],
            "repositoryDocument": {
                "pdfStatus": 1,
                "metadataAdded": 1549435529000,
                "metadataUpdated": 1608820839000,
                "depositedDate": 1540335600000
            },
            "subjects": [
                "text"
            ],
            "title": "Biomedical Document Clustering and Visualization based on the Concepts\n  of Diseases",
            "topics": [
                "Computer Science - Computation and Language",
                "Computer Science - Artificial Intelligence",
                "Computer Science - Machine Learning"
            ],
            "types": [],
            "year": 2018,
            "fulltextIdentifier": "http://arxiv.org/abs/1810.09597",
            "oai": "oai:arXiv.org:1810.09597",
            "downloadUrl": "http://arxiv.org/abs/1810.09597"
        }
    ]
}