[
    {
        "title": "CD28null CD4 T-cell expansions in autoimmune disease suggest a link with cytomegalovirus infection",
        "description": "Immunosenescence is thought to contribute to the increase of autoimmune diseases in older people. Immunosenescence is often associated with the presence of an expanded population of CD4 T cells lacking expression of CD28 (CD28null). These highly cytotoxic CD4 T cells were isolated from disease-affected tissues in patients with rheumatoid arthritis, systemic lupus erythematosus, multiple sclerosis, or other chronic inflammatory diseases and their numbers appeared to be linked to disease severity. However, we recently demonstrated that the common herpes virus, cytomegalovirus (CMV), not ageing, is the major driver of this subset of cytotoxic T cells. In this review, we discuss how CMV might potentiate and exacerbate autoimmune disease through the expansion of CD28null CD4 T cells",
        "authors": [
            "Bano, Aalia",
            "Pera Rojas, Alejandra",
            "Almoukayed, Ahmad",
            "Clarke, Thomas H S",
            "Kirmani, Sukaina",
            "Davies, Kevin A",
            "Kern, Florian"
        ],
        "datePublished": "2019-03-25T00:00:00",
        "downloadUrl": "https://core.ac.uk/download/201000780.pdf"
    },
    {
        "title": "Natural killer cells in herpesvirus infections",
        "description": "Natural killer (NK) cells are potent innate cytotoxic lymphocytes for the destruction of infected and transformed cells. Although they were originally considered to be ready-made assassins after their hematopoietic development, it has recently become clear that their activity is regulated by mechanisms such as repertoire composition, licensing, priming, and adaptive memory-like differentiation. Some of these mechanisms are influenced by infectious disease agents, including herpesviruses. In this review, we will compare expansion, stimulation, and effector functions of NK cell populations after infections with β- and γ 1-herpesviruses because, though closely related, these pathogens seem to drive completely opposite NK cell responses. The discussed findings suggest that different NK cell subsets expand and perform protective functions during infectious diseases and might be used diagnostically to predict resistance to the causative pathogens as well as treat them by adoptive transfer of the respective populations",
        "authors": [
            "Münz, Christian",
            "Chijioke, Obinna"
        ],
        "datePublished": "2017",
        "downloadUrl": "http://www.zora.uzh.ch/id/eprint/147980/1/Munz_and_Chijioke%2C_F1000Research_2017.pdf"
    },
    {
        "title": "Effects of Plantago major extracts and its chemical compounds on proliferation of cancer cells and cytokines\n\nproduction of lipopolysaccharide-activated THP-1 macrophages",
        "description": "Background: Plantago major has been reported to have anticancer and anti-inflammatory properties. However, its antiproliferative and anti-inflammatory mechanisms have not elucidated. Moreover, which plant parts are more suitable as starting materials has not been explored. Objectives: To investigate the antiproliferative activity of P. major\n\nMCF-7, MDA-MB-231, HeLaS3, A549, and KB cancer cell lines as well as their effects on inflammatory cytokines (tumor necrosis factor [TNF]-a, interleukin [IL]-1β, IL-6, an\n\n[IFN]-g) production by lipopolysaccharide (LPS)-stimulated THP-1 macrophages. Materials and Methods: The methanol and aqueous extracts of P. major from different plant its chemical compounds, i.e., ursolic acid (UA), oleanolic acid (OA), and aucubin were tested in this experiment. Results: Methanol and aqueous extracts of P. major\n\ngreatest antiproliferative activity. The methanol extracts of seeds also demonstrated the highest inhibition of TNF-a, IL-1β, IL-6, and IFN-g production. Interestingly, t\n\ncommonly discarded, exhibited comparable activities to those of leaves and petioles. Furthermore, UA exhibited stronger activities than OA and aucubin. Conclusions:\n\nbeing proposed as the main source for further development of anticancer and anti-inflammatory products, whereas the roots could be included in the preparation of\n\nproducts with respect to anti-inflammatory",
        "authors": [
            "Kartini, Kartini",
            "Piyaviriyakul, Suratsawadee",
            "Thongpraditchote, Suchitra",
            "Siripong, Pongpun",
            "Vallisuta, Omboon"
        ],
        "datePublished": "2017-07-19T00:00:00",
        "downloadUrl": "https://core.ac.uk/download/85124355.pdf"
    },
    {
        "title": "A Systematic Review On Cytotoxicity Of Plant-Mediated Metallic Nanoparticles",
        "description": "Nanoteknologi menawarkan kegunaan yang meluas dalam pelbagai bidang seperti kejuruteraan, telekomunikasi, pengiklanan, tekstil, kosmetik, dan juga perubatan\n\n\n\nNanotechnology has undeniably offered a variety of applications, ranging from engineering, telecommunication, advertising, textile, cosmetics and even medicin",
        "authors": [
            "Hanan, Nurul Akma"
        ],
        "datePublished": "2017-08-01T00:00:00",
        "downloadUrl": "https://core.ac.uk/download/153211941.pdf"
    },
    {
        "title": "A Pilot Study Identifying Brain-Targeting Adaptive Immunity in Pediatric Extracorporeal Membrane Oxygenation Patients with Acquired Brain Injury",
        "description": "OBJECTIVES: Extracorporeal membrane oxygenation provides short-term cardiopulmonary life support, but is associated with peripheral innate inflammation, disruptions in cerebral autoregulation, and acquired brain injury. We tested the hypothesis that extracorporeal membrane oxygenation also induces CNS-directed adaptive immune responses which may exacerbate extracorporeal membrane oxygenation-associated brain injury.\nDESIGN: A single center prospective observational study.\nSETTING: Pediatric and cardiac ICUs at a single tertiary care, academic center.\nPATIENTS: Twenty pediatric extracorporeal membrane oxygenation patients (0-14 yr; 13 females, 7 males) and five nonextracorporeal membrane oxygenation Pediatric Logistic Organ Dysfunction score matched patients.\nINTERVENTIONS: None.\nMEASUREMENTS AND MAIN RESULTS: Venous blood samples were collected from the extracorporeal membrane oxygenation circuit at day 1 (10-23 hr), day 3, and day 7 of extracorporeal membrane oxygenation. Flow cytometry quantified circulating innate and adaptive immune cells, and CNS-directed autoreactivity was detected using an in vitro recall response assay. Disruption of cerebral autoregulation was determined using continuous bedside near-infrared spectroscopy and acquired brain injury confirmed by MRI. Extracorporeal membrane oxygenation patients with acquired brain injury (n = 9) presented with a 10-fold increase in interleukin-8 over extracorporeal membrane oxygenation patients without brain injury (p \\u3c 0.01). Furthermore, brain injury within extracorporeal membrane oxygenation patients potentiated an inflammatory phenotype in adaptive immune cells and selective autoreactivity to brain peptides in circulating B cell and cytotoxic T cell populations. Correlation analysis revealed a significant relationship between adaptive immune responses of extracorporeal membrane oxygenation patients with acquired brain injury and loss of cerebral autoregulation.\nCONCLUSIONS: We show that pediatric extracorporeal membrane oxygenation patients with acquired brain injury exhibit an induction of pro-inflammatory cell signaling, a robust activation of adaptive immune cells, and CNS-targeting adaptive immune responses. As these patients experience developmental delays for years after extracorporeal membrane oxygenation, it is critical to identify and characterize adaptive immune cell mechanisms that target the developing CNS",
        "authors": [
            "Ortega, Sterling B.",
            "Pandiyan, Poornima",
            "Windsor, Jana",
            "Torres, Vanessa O.",
            "Selvaraj, Uma M.",
            "Lee, Amy",
            "Morriss, Michael",
            "Tian, Fenghua",
            "Raman, Lakshmi",
            "Stowe, Ann M."
        ],
        "datePublished": "2019-03-01T08:00:00",
        "downloadUrl": "https://core.ac.uk/download/363910527.pdf"
    },
    {
        "title": "Ruthenium-containing linear helicates and mesocates with tuneable p53 selective cytotoxicity in colorectal cancer cells",
        "description": "YesThe ligands L1 and L2 both form separable dinuclear double‐stranded helicate and mesocate complexes with RuII. In contrast to clinically approved platinates, the helicate isomer of [Ru2(L1)2]4+ was preferentially cytotoxic to isogenic cells (HCT116 p53−/−), which lack the critical tumour suppressor gene. The mesocate isomer shows the reverse selectivity, with the achiral isomer being preferentially cytotoxic towards HCT116 p53+/+. Other structurally similar RuII‐containing dinuclear complexes showed very little cytotoxic activity. This study demonstrates that alterations in ligand or isomer can have profound effects on cytotoxicity towards cancer cells of different p53 status and suggests that selectivity can be “tuned” to either genotype. In the search for compounds that can target difficult‐to‐treat tumours that lack the p53 tumour suppressor gene, [Ru2(L1)2]4+ is a promising compound for further development",
        "authors": [
            "Allison, S.J.",
            "Cooke, D.",
            "Davidson, F.S.",
            "Elliott, P.I.P.",
            "Faulkner, R.A.",
            "Griffiths, H.B.S.",
            "Harper, O.J.",
            "Hussain, O.",
            "Owen-Lynch, P.J.",
            "Phillips, Roger M.",
            "Rice, C.R.",
            "Shepherd, S.L.",
            "Wheelhouse, Richard T."
        ],
        "datePublished": "2018-06-04T00:00:00",
        "downloadUrl": "https://core.ac.uk/download/161874969.pdf"
    },
    {
        "title": "Calotroposid A: a Glycosides Terpenoids from Calotropis gigantea Induces Apoptosis of Colon Cancer WiDr Cells through Cell Cycle Arrest G2/M and Caspase 8 Expression",
        "description": "Objective: This study aims to isolate the active anticancer compound from ethyl acetate fraction extracted from the roots of Calotropis gigantea and to determine the operating mechanism of the isolates towards WiDr colon cancer cells. Methods: the isolation was conducted by using bioassay guided isolation approach method. The cytotoxic potential was determined by using MTT method. The chemical structure was identified by using UPLCMS/MS and NMR-1H spectroscopy. The cell cycle arrest and apoptosis induction were determined by flow cytometry method. The expression of caspase-8 was determined by immunocytochemistry method. Results: The results showed that the active compounds are obtained calotroposid A compound which is glycosides terpenoids. Calotroposide A is capable of inhibiting the growth of WiDr colon cancer cells at IC50 17.23μg/ml. Cell apoptosis induction took place and was indicated by cell apoptosis increase, S and G2/M accumulation and by caspase-8 expression. Conclusion: Calotroposide A induces anticancer activity against WiDr colon cancer cells by means of apoptosis induction mechanism through extrinsic pathway with increased expression of caspase-8",
        "authors": [
            "Mutiah, Roihatul",
            "Sukardiman, Sukardiman",
            "Widyawaruyanti, Aty"
        ],
        "datePublished": "2018-06-01T00:00:00",
        "downloadUrl": "https://core.ac.uk/download/159176612.pdf"
    },
    {
        "title": "Incorporating DNA Methyltransferase Inhibitors (DNMTis) in the Treatment of Genitourinary Malignancies: A Systematic Review",
        "description": "Inhibition of DNA methyltransferases (DNMTs) has emerged as a novel treatment strategy in solid tumors. Aberrant hypermethylation in promoters of critical tumor suppressor genes is the basis for the idea that treatment with hypomethylating agents may lead to the restoration of a “normal” epigenome and produce clinically meaningful therapeutic outcomes. The aim of this review article is to summarize the current state of knowledge of DNMT inhibitors in the treatment of genitourinary malignancies. The efficacy of these agents in genitourinary malignancies was reported in a number of studies and suggests a role of induced DNA hypomethylation in overcoming resistance to conventional cytotoxic treatments. The clinical significance of these findings should be further investigated",
        "authors": [
            "Chovanec, Michal",
            "Taza, Fadi",
            "Kalra, Maitri",
            "Hah, Noah",
            "Nephew, Kenneth P.",
            "Spinella, Michael J.",
            "Albany, Costantine"
        ],
        "datePublished": "2018-02-01T00:00:00",
        "downloadUrl": "https://core.ac.uk/download/160494288.pdf"
    },
    {
        "title": "Transient Receptor Potential Melastatin 3 and Intracellular Calcium in Natural Killer Cells in Multiple Sclerosis",
        "description": "Background: Natural killer (NK) cell phenotypes have reported to be implicated in the pathomechanism of Multiple Sclerosis (MS). Several investigators have observed reduced peripheral numbers, reduced cytotoxic activity, and altered CD56Dim and CD56Bright NK cell phenotypes. This current project, for the first time, investigates the NK cell cytotoxicity, calcium mobilisation and transient receptor potential melastatin 3 (TRPM3) surface expression. Methods: NK cell cytotoxic activity and calcium signaling were examined in CD56Dim and CD56Bright NK cells before and after stimulation using Ionomycin, Pregnenolone sulphate, 2-Aminoethoxydiphenyl borate and Thapsigargin. Purified NK cells were labelled with antibodies to determine TRPM3, CD69 and CD107a surface expression using flow cytometry. Results: Twenty-two MS patients and 22 healthy controls were recruited for this project. Twelve of the 22 previously received Alemtuzumab (LemtradaÒ) and the remaining ten reported nil medication. We report TRPM3 was significantly increased in untreated MS patients compared with healthy controls and treated MS patients (p-value 0.034). There was a significant decrease in CD69 surface expression on CD56Dim NK cell phenotype for untreated MS patients (p-value 0.031) and treated MS patients (p-value 0.036). We report altered calcium mobilisation in CD56Bright NK cells and to a lesser extent CD56Dim NK cells between healthy controls, treated and untreated MS patients. Conclusion: This investigation suggests variations in TRPM3 expression and calcium mobilisation of NK cells may be implicated in the pathogenesis of MS. Further investigation is required to determine the mechanism by which alemtuzumab alters calcium signaling in NK cells.Griffith Health, School of Medical ScienceFull Tex",
        "authors": [
            "Clarke, Laura",
            "Broadley, Simon",
            "Nguyen, Thao",
            "Johnston, Samantha",
            "Eaton, Natalie",
            "Staines, Donald",
            "Marshall-Gradisnik, Sonya"
        ],
        "datePublished": "2018",
        "downloadUrl": "https://core.ac.uk/download/pdf/185703269.pdf"
    },
    {
        "title": "The Potential of Indonesian Heterobranchs Found around Bunaken Island for the Production of Bioactive Compounds",
        "description": "The species diversity of marine heterobranch sea slugs found on field trips around Bunaken Island (North Sulawesi, Indonesia) and adjacent islands of the Bunaken National Marine Park forms the basis of this review. In a survey performed in 2015, 80 species from 23 families were collected, including 17 new species. Only three of these have been investigated previously in studies from Indonesia. Combining species diversity with a former study from 2003 reveals in total 140 species from this locality. The diversity of bioactive compounds known and yet to be discovered from these organisms is summarized and related to the producer if known or suspected (might it be down the food chain, de novo synthesised from the slug or an associated bacterium). Additionally, the collection of microorganisms for the discovery of natural products of pharmacological interest from this hotspot of biodiversity that is presented here contains more than 50 species that have never been investigated before in regard to bioactive secondary metabolites. This highlights the great potential of the sea slugs and the associated microorganisms for the discovery of natural products of pharmacological interest from this hotspot of biodiversity",
        "authors": [
            "Fisch, Katja M.",
            "Hertzer, Cora",
            "Böhringer, Nils",
            "Wuisan, Zerlina G.",
            "Schillo, Dorothee",
            "Bara, Robert",
            "Kaligis, Fontje",
            "Wägele, Heike",
            "König, Gabriele M.",
            "Schäberle, Till F."
        ],
        "datePublished": "2017-01-01T00:00:00",
        "downloadUrl": "https://core.ac.uk/download/200974362.pdf"
    }
]
